Revit 2015 API
EnergyDataSettings Properties
The EnergyDataSettings type exposes the following members.
Properties
Name | Description
AnalyticalGridCellSize
 The cell size for the uniform cubical grid used when computing the building envelope
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
BuildingConstructionClass
 Used for both the detailed and conceptual energy model Construction class of building as defined by: loose, medium, tight, or none.
BuildingEnvelopeDeterminationMethod
 Indicates if an analysis should be perform to find the model elements that are part of the building envelope
BuildingHVACSystem
 The type of HVAC system used by the building for conceptual model energy calculations.
BuildingOperatingSchedule
 The operating schedule of the building used for conceptual model energy calculations.
BuildingType
 The type of building.
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreateAnalyticalModel
 If this is true, data, features, and geometry related to the Energy Analytical Model will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
EnergyModel
 if this is on there should be an energy model dependent on the current AnalysisType if it is off the conceptual energy model should be turned off but setting this datum does not do the work, just reflects the state.
ExportCategory
 Value is a category indicating which discipline model will be used for GreenBuildingXML export.
ExportComplexity
 Value determines Export Complexity for GreenBuildingXML detailed model export.
ExportDefaults
 Use for detailed model GreenBuildingXML export. When this setting is true, all building and space defaults, schedules, and constructions will be exported to GreenBuildingXML. When this setting is false, only values that are specified on the zone or space will be exported to GreenBuildingXML.
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroundPlane
 Id of level which represents ground level.
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IncludeThermalProperties
 Indicates if thermal information from model assemblies and components is included in GreenBuildingXML export of the detailed model.
IsExportMullionsEnabled
 Indicates if mullions are included in GreenBuildingXML export of the detailed model.
IsExportShadingSurfacesEnabled
 Indicates if "shading surfaces" are included in GreenBuildingXML export of the detailed model.
IsExportSimplifiedCurtainSystemsEnabled
 Indicates if curtain system geometry is being simplified for GreenBuildingXML export of the detailed model.
IsGlazingShaded
 If this is true, glazing/windows that are auto-created on exterior walls will automatically have a shading device created on their top edge.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
MassZoneCoreOffset
 It defines the default behavior for the automatic generation of Mass Zones for each Mass Floor in the Project. Specifying a value here will offset the outside perimeter of a Mass Zone to create the core.
MassZoneDividePerimeter
 If this is true, outward facing zones on each floor of the building will be divided based on the four compass directions.
Name
A human readable name for the Element.
 (Inherited from Element.)
OutsideAirChangesRatePerHour
 The number of times the volume of air interchanges in the room in one hour.
OutsideAirPerArea
 The rate of flow of outside air available per unit area.
OutsideAirPerPerson
 The rate of flow of outside air available per person.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[String]
Retrieves a parameter from the element given its name.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
PercentageGlazing
 Used for the conceptual energy model. The approximate percentage of the building exterior wall surfaces which are covered by windows or other glazing.
PercentageSkylights
 Used for the conceptual energy model. The approximate percentage of the building roof surfaces in massing instances for the Conceptual Energy Analytical Model.
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
ProjectPhase
 The project phase of the EnergyData information.
ProjectReportType
 Report type: None, simple, standard, detailed
ServiceType
 The type of heating or cooling system.
ShadeDepth
 Used for the conceptual energy model. Amount that auto-generated shading will extend from auto-generated windows.
SillHeight
 Used for the conceptual energy model. The height from the nearest lower level used for auto-glazing created on walls.
SkylightWidth
 Used for the conceptual energy model. The approximate width used for the skylights in massing instances when the Energy Analytical model is being created.
SliverSpaceTolerance
 Used for Detailed GreenBuildingXML export. This value is used to identify sliver spaces, i.e. spaces bounded by parallel surfaces belonging to different rooms.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UseAirChangesPerHour
 True if user is specifying air changes per hour, false otherwise.
UseHeatingCredits
 If true, Revit will use heating credits in the final load sum calculations. If false, Revit will ignore heating credits in the final load sum calculations.
UseOutsideAirPerArea
 True is user is specifying outside air per area, false otherwise.
UseOutsideAirPerPerson
 True if user is specifying outside air per person, false otherwise.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace